#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ACT-Terraform-Demos/demo-github-actions/runs/run-cNDutDGiphZYW1ds

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
2023-01-18T05:27:20.131Z [INFO]  Terraform version: 1.3.7
2023-01-18T05:27:20.131Z [DEBUG] using github.com/hashicorp/go-tfe v1.9.0
2023-01-18T05:27:20.131Z [DEBUG] using github.com/hashicorp/hcl/v2 v2.15.0
2023-01-18T05:27:20.131Z [DEBUG] using github.com/hashicorp/terraform-config-inspect v0.0.0-20210209133302-4fd17a0faac2
2023-01-18T05:27:20.131Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.0.0-20200729002733-f050f53b9734
2023-01-18T05:27:20.131Z [DEBUG] using github.com/zclconf/go-cty v1.12.1
2023-01-18T05:27:20.131Z [INFO]  Go runtime version: go1.19.4
2023-01-18T05:27:20.131Z [INFO]  CLI args: []string{"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-cNDutDGiphZYW1ds/bin/terraform", "plan", "-out=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-cNDutDGiphZYW1ds/config/terraform.tfplan", "-var-file=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-cNDutDGiphZYW1ds/terraform.tfvars", "-detailed-exitcode", "-lock=false"}
2023-01-18T05:27:20.131Z [DEBUG] Attempting to open CLI config file: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-cNDutDGiphZYW1ds/.terraformrc
2023-01-18T05:27:20.131Z [INFO]  Loading CLI configuration from /home/tfc-agent/.tfc-agent/component/terraform/runs/run-cNDutDGiphZYW1ds/.terraformrc
2023-01-18T05:27:20.132Z [DEBUG] checking for credentials in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-cNDutDGiphZYW1ds/.terraform.d/plugins"
2023-01-18T05:27:20.132Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2023-01-18T05:27:20.132Z [DEBUG] will search for provider plugins in /home/tfc-agent/.tfc-agent/component/terraform/runs/run-cNDutDGiphZYW1ds/.terraform.d/plugins
2023-01-18T05:27:20.133Z [DEBUG] ignoring non-existing provider search directory /home/tfc-agent/.tfc-agent/component/terraform/runs/run-cNDutDGiphZYW1ds/.local/share/terraform/plugins
2023-01-18T05:27:20.133Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2023-01-18T05:27:20.133Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2023-01-18T05:27:20.134Z [INFO]  CLI command args: []string{"plan", "-out=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-cNDutDGiphZYW1ds/config/terraform.tfplan", "-var-file=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-cNDutDGiphZYW1ds/terraform.tfvars", "-detailed-exitcode", "-lock=false"}
2023-01-18T05:27:20.136Z [DEBUG] Service discovery for app.terraform.io at https://app.terraform.io/.well-known/terraform.json
2023-01-18T05:27:20.794Z [DEBUG] checking for provisioner in "."
2023-01-18T05:27:20.795Z [DEBUG] checking for provisioner in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-cNDutDGiphZYW1ds/bin"
2023-01-18T05:27:20.795Z [DEBUG] checking for provisioner in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-cNDutDGiphZYW1ds/.terraform.d/plugins"
2023-01-18T05:27:20.859Z [INFO]  backend/local: starting Plan operation
2023-01-18T05:27:20.937Z [DEBUG] backend/local: Skipping interactive prompts for variables because input is disabled
2023-01-18T05:27:20.937Z [DEBUG] Building and walking validate graph
2023-01-18T05:27:20.937Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:27:20.937Z [DEBUG] ProviderTransformer: "random_pet.sg" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/hashicorp/random"]
2023-01-18T05:27:20.937Z [DEBUG] ProviderTransformer: "aws_instance.web" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:27:20.938Z [DEBUG] created provider logger: level=debug
2023-01-18T05:27:20.938Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:27:20.956Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5]
2023-01-18T05:27:20.959Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=70
2023-01-18T05:27:20.959Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5
2023-01-18T05:27:20.975Z [INFO]  provider.terraform-provider-random_v3.0.1_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:27:20.975Z
2023-01-18T05:27:21.003Z [DEBUG] provider.terraform-provider-random_v3.0.1_x5: plugin address: address=/tmp/plugin346379383 network=unix timestamp=2023-01-18T05:27:21.002Z
2023-01-18T05:27:21.003Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:27:21.037Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:27:21.038Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=70
2023-01-18T05:27:21.038Z [DEBUG] provider: plugin exited
2023-01-18T05:27:21.038Z [DEBUG] created provider logger: level=debug
2023-01-18T05:27:21.038Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:27:21.045Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5]
2023-01-18T05:27:21.048Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=82
2023-01-18T05:27:21.048Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5
2023-01-18T05:27:21.094Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:27:21.094Z
2023-01-18T05:27:21.120Z [DEBUG] provider.terraform-provider-aws_v3.26.0_x5: plugin address: address=/tmp/plugin979806630 network=unix timestamp=2023-01-18T05:27:21.120Z
2023-01-18T05:27:21.120Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:27:21.258Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:27:21.259Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=82
2023-01-18T05:27:21.259Z [DEBUG] provider: plugin exited
2023-01-18T05:27:21.259Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg" references: [random_pet.sg]
2023-01-18T05:27:21.259Z [DEBUG] ReferenceTransformer: "output.web-address (expand)" references: [aws_instance.web]
2023-01-18T05:27:21.259Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/random\"]" references: []
2023-01-18T05:27:21.259Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/aws\"]" references: []
2023-01-18T05:27:21.259Z [DEBUG] ReferenceTransformer: "random_pet.sg" references: []
2023-01-18T05:27:21.260Z [DEBUG] ReferenceTransformer: "aws_instance.web" references: [aws_security_group.web-sg]
2023-01-18T05:27:21.260Z [DEBUG] Starting graph walk: walkValidate
2023-01-18T05:27:21.260Z [DEBUG] created provider logger: level=debug
2023-01-18T05:27:21.261Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:27:21.268Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5]
2023-01-18T05:27:21.272Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=108
2023-01-18T05:27:21.272Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5
2023-01-18T05:27:21.322Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:27:21.322Z
2023-01-18T05:27:21.346Z [DEBUG] provider.terraform-provider-aws_v3.26.0_x5: plugin address: address=/tmp/plugin310568878 network=unix timestamp=2023-01-18T05:27:21.346Z
2023-01-18T05:27:21.346Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:27:21.378Z [DEBUG] created provider logger: level=debug
2023-01-18T05:27:21.379Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:27:21.385Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5]
2023-01-18T05:27:21.388Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=126
2023-01-18T05:27:21.388Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5
2023-01-18T05:27:21.406Z [INFO]  provider.terraform-provider-random_v3.0.1_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:27:21.406Z
2023-01-18T05:27:21.440Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:27:21.440Z [DEBUG] provider.terraform-provider-random_v3.0.1_x5: plugin address: address=/tmp/plugin286948117 network=unix timestamp=2023-01-18T05:27:21.440Z
2023-01-18T05:27:21.481Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:27:21.482Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=126
2023-01-18T05:27:21.482Z [DEBUG] provider: plugin exited
2023-01-18T05:27:21.556Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:27:21 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:27:21.555Z
2023-01-18T05:27:21.556Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:27:21 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:27:21.556Z
2023-01-18T05:27:21.559Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:27:21.559Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=108
2023-01-18T05:27:21.559Z [DEBUG] provider: plugin exited
2023-01-18T05:27:21.560Z [INFO]  backend/local: plan calling Plan
2023-01-18T05:27:21.560Z [DEBUG] Building and walking plan graph for NormalMode
2023-01-18T05:27:21.561Z [DEBUG] ProviderTransformer: "aws_instance.web (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:27:21.561Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:27:21.561Z [DEBUG] ProviderTransformer: "random_pet.sg (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/hashicorp/random"]
2023-01-18T05:27:21.561Z [DEBUG] ReferenceTransformer: "random_pet.sg (expand)" references: []
2023-01-18T05:27:21.561Z [DEBUG] ReferenceTransformer: "output.web-address (expand)" references: [aws_instance.web (expand)]
2023-01-18T05:27:21.561Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/random\"]" references: []
2023-01-18T05:27:21.561Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/aws\"]" references: []
2023-01-18T05:27:21.561Z [DEBUG] ReferenceTransformer: "aws_instance.web (expand)" references: [aws_security_group.web-sg (expand)]
2023-01-18T05:27:21.561Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg (expand)" references: [random_pet.sg (expand)]
2023-01-18T05:27:21.562Z [DEBUG] Starting graph walk: walkPlan
2023-01-18T05:27:21.562Z [DEBUG] created provider logger: level=debug
2023-01-18T05:27:21.563Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:27:21.570Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5]
2023-01-18T05:27:21.573Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=142
2023-01-18T05:27:21.573Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5
2023-01-18T05:27:21.620Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:27:21.620Z
2023-01-18T05:27:21.646Z [DEBUG] provider.terraform-provider-aws_v3.26.0_x5: plugin address: address=/tmp/plugin380944973 network=unix timestamp=2023-01-18T05:27:21.646Z
2023-01-18T05:27:21.646Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:27:21.676Z [DEBUG] created provider logger: level=debug
2023-01-18T05:27:21.677Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:27:21.685Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5]
2023-01-18T05:27:21.688Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=162
2023-01-18T05:27:21.688Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5
2023-01-18T05:27:21.702Z [INFO]  provider.terraform-provider-random_v3.0.1_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:27:21.702Z
2023-01-18T05:27:21.734Z [DEBUG] provider.terraform-provider-random_v3.0.1_x5: plugin address: address=/tmp/plugin630281409 network=unix timestamp=2023-01-18T05:27:21.734Z
2023-01-18T05:27:21.735Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:27:21.773Z [DEBUG] Resource instance state not found for node "random_pet.sg", instance random_pet.sg
2023-01-18T05:27:21.773Z [DEBUG] ReferenceTransformer: "random_pet.sg" references: []
2023-01-18T05:27:21.773Z [DEBUG] refresh: random_pet.sg: no state, so not refreshing
2023-01-18T05:27:21.775Z [WARN]  Provider "registry.terraform.io/hashicorp/random" produced an invalid plan for random_pet.sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .length: planned value cty.NumberIntVal(2) for a non-computed attribute
      - .separator: planned value cty.StringVal("-") for a non-computed attribute
2023-01-18T05:27:21.776Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:27:21.776Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=162
2023-01-18T05:27:21.776Z [DEBUG] provider: plugin exited
2023-01-18T05:27:21.831Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/hashicorp/aws\"]" changed the config value, but that value is unused
2023-01-18T05:27:21.833Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:27:21 [INFO] AWS Auth provider used: "EnvProvider": timestamp=2023-01-18T05:27:21.833Z
2023-01-18T05:27:21.833Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:27:21 [DEBUG] Trying to get account information via sts:GetCallerIdentity: timestamp=2023-01-18T05:27:21.833Z
2023-01-18T05:27:21.834Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:27:21 [DEBUG] [aws-sdk-go] DEBUG: Request sts/GetCallerIdentity Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: sts.amazonaws.com
User-Agent: aws-sdk-go/1.37.0 (go1.15.5; linux; amd64) APN/1.0 HashiCorp/1.0 Terraform/1.3.7 (+https://www.terraform.io)
Content-Length: 43
Authorization: AWS4-HMAC-SHA256 Credential=AKIAUQDIWPF747OPMC53/20230118/us-east-1/sts/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=784d102bd740346444a37ceaa777effc5b27325945b57b090de999a9b6a26b80
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20230118T052721Z
Accept-Encoding: gzip

Action=GetCallerIdentity&Version=2011-06-15
-----------------------------------------------------: timestamp=2023-01-18T05:27:21.833Z
2023-01-18T05:27:21.866Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:27:21 [DEBUG] [aws-sdk-go] DEBUG: Response sts/GetCallerIdentity Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 OK
Connection: close
Content-Length: 407
Content-Type: text/xml
Date: Wed, 18 Jan 2023 05:27:21 GMT
X-Amzn-Requestid: ffd4984b-3ae4-4dcf-8ffc-87208e237849


-----------------------------------------------------: timestamp=2023-01-18T05:27:21.866Z
2023-01-18T05:27:21.866Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:27:21 [DEBUG] [aws-sdk-go] <GetCallerIdentityResponse xmlns="https://sts.amazonaws.com/doc/2011-06-15/">
  <GetCallerIdentityResult>
    <Arn>arn:aws:iam::309457222015:user/cloud_user</Arn>
    <UserId>AIDAUQDIWPF73WNRR5PPF</UserId>
    <Account>309457222015</Account>
  </GetCallerIdentityResult>
  <ResponseMetadata>
    <RequestId>ffd4984b-3ae4-4dcf-8ffc-87208e237849</RequestId>
  </ResponseMetadata>
</GetCallerIdentityResponse>: timestamp=2023-01-18T05:27:21.866Z
2023-01-18T05:27:21.866Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:27:21 [DEBUG] Trying to get account information via sts:GetCallerIdentity: timestamp=2023-01-18T05:27:21.866Z
2023-01-18T05:27:21.866Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:27:21 [DEBUG] [aws-sdk-go] DEBUG: Request sts/GetCallerIdentity Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: sts.amazonaws.com
User-Agent: aws-sdk-go/1.37.0 (go1.15.5; linux; amd64) APN/1.0 HashiCorp/1.0 Terraform/1.3.7 (+https://www.terraform.io)
Content-Length: 43
Authorization: AWS4-HMAC-SHA256 Credential=AKIAUQDIWPF747OPMC53/20230118/us-east-1/sts/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=784d102bd740346444a37ceaa777effc5b27325945b57b090de999a9b6a26b80
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20230118T052721Z
Accept-Encoding: gzip

Action=GetCallerIdentity&Version=2011-06-15
-----------------------------------------------------: timestamp=2023-01-18T05:27:21.866Z
2023-01-18T05:27:21.886Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:27:21 [DEBUG] [aws-sdk-go] DEBUG: Response sts/GetCallerIdentity Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 OK
Connection: close
Content-Length: 407
Content-Type: text/xml
Date: Wed, 18 Jan 2023 05:27:21 GMT
X-Amzn-Requestid: 6b571651-422d-4db8-95ad-9957601aed5a


-----------------------------------------------------: timestamp=2023-01-18T05:27:21.885Z
2023-01-18T05:27:21.886Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:27:21 [DEBUG] [aws-sdk-go] <GetCallerIdentityResponse xmlns="https://sts.amazonaws.com/doc/2011-06-15/">
  <GetCallerIdentityResult>
    <Arn>arn:aws:iam::309457222015:user/cloud_user</Arn>
    <UserId>AIDAUQDIWPF73WNRR5PPF</UserId>
    <Account>309457222015</Account>
  </GetCallerIdentityResult>
  <ResponseMetadata>
    <RequestId>6b571651-422d-4db8-95ad-9957601aed5a</RequestId>
  </ResponseMetadata>
</GetCallerIdentityResponse>: timestamp=2023-01-18T05:27:21.885Z
2023-01-18T05:27:21.887Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:27:21 [DEBUG] [aws-sdk-go] DEBUG: Request ec2/DescribeAccountAttributes Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: ec2.us-west-2.amazonaws.com
User-Agent: aws-sdk-go/1.37.0 (go1.15.5; linux; amd64) APN/1.0 HashiCorp/1.0 Terraform/1.3.7 (+https://www.terraform.io)
Content-Length: 87
Authorization: AWS4-HMAC-SHA256 Credential=AKIAUQDIWPF747OPMC53/20230118/us-west-2/ec2/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=26477a23ee977be9426d4d3bedcfd107b8bb6d477206a6521a9d26ddac1cdb0c
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20230118T052721Z
Accept-Encoding: gzip

Action=DescribeAccountAttributes&AttributeName.1=supported-platforms&Version=2016-11-15
-----------------------------------------------------: timestamp=2023-01-18T05:27:21.887Z
2023-01-18T05:27:22.247Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:27:22 [DEBUG] [aws-sdk-go] DEBUG: Response ec2/DescribeAccountAttributes Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 OK
Connection: close
Content-Length: 540
Cache-Control: no-cache, no-store
Content-Type: text/xml;charset=UTF-8
Date: Wed, 18 Jan 2023 05:27:21 GMT
Keep-Alive: timeout=20
Server: AmazonEC2
Strict-Transport-Security: max-age=31536000; includeSubDomains
X-Amzn-Requestid: 93c41ea1-894e-40bb-aa09-13ce9363173c


-----------------------------------------------------: timestamp=2023-01-18T05:27:22.247Z
2023-01-18T05:27:22.247Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:27:22 [DEBUG] [aws-sdk-go] <?xml version="1.0" encoding="UTF-8"?>
<DescribeAccountAttributesResponse xmlns="http://ec2.amazonaws.com/doc/2016-11-15/">
    <requestId>93c41ea1-894e-40bb-aa09-13ce9363173c</requestId>
    <accountAttributeSet>
        <item>
            <attributeName>supported-platforms</attributeName>
            <attributeValueSet>
                <item>
                    <attributeValue>VPC</attributeValue>
                </item>
            </attributeValueSet>
        </item>
    </accountAttributeSet>
</DescribeAccountAttributesResponse>: timestamp=2023-01-18T05:27:22.247Z
2023-01-18T05:27:22.247Z [DEBUG] Resource instance state not found for node "aws_security_group.web-sg", instance aws_security_group.web-sg
2023-01-18T05:27:22.248Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg" references: []
2023-01-18T05:27:22.248Z [DEBUG] refresh: aws_security_group.web-sg: no state, so not refreshing
2023-01-18T05:27:22.249Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:27:22 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:27:22.249Z
2023-01-18T05:27:22.249Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:27:22 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:27:22.249Z
2023-01-18T05:27:22.252Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.web-sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .description: planned value cty.StringVal("Managed by Terraform") for a non-computed attribute
      - .ingress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal(""), "from_port":cty.NumberIntVal(8080), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(8080)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.NullVal(cty.String), "from_port":cty.NumberIntVal(8080), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(8080)})})
      - .egress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal(""), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("-1"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.NullVal(cty.String), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("-1"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
2023-01-18T05:27:22.252Z [DEBUG] Resource instance state not found for node "aws_instance.web", instance aws_instance.web
2023-01-18T05:27:22.252Z [DEBUG] ReferenceTransformer: "aws_instance.web" references: []
2023-01-18T05:27:22.252Z [DEBUG] refresh: aws_instance.web: no state, so not refreshing
2023-01-18T05:27:22.256Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_instance.web, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .source_dest_check: planned value cty.True for a non-computed attribute
      - .vpc_security_group_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)})
      - .user_data: planned value cty.StringVal("d36263b945850b1251dc22e4ed5c62aeb9e9e0f0") does not match config value cty.StringVal("#!/bin/bash\napt-get update\napt-get install -y apache2\nsed -i -e 's/80/8080/' /etc/apache2/ports.conf\necho \"Hello World\" > /var/www/html/index.html\nsystemctl restart apache2\n")
      - .get_password_data: planned value cty.False for a non-computed attribute
      - .ebs_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .enclave_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .ephemeral_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .metadata_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .network_interface: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .root_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2023-01-18T05:27:22.257Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:27:22.258Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=142
2023-01-18T05:27:22.258Z [DEBUG] provider: plugin exited
2023-01-18T05:27:22.258Z [DEBUG] building apply graph to check for errors
2023-01-18T05:27:22.258Z [DEBUG] Resource state not found for node "random_pet.sg", instance random_pet.sg
2023-01-18T05:27:22.258Z [DEBUG] Resource state not found for node "aws_security_group.web-sg", instance aws_security_group.web-sg
2023-01-18T05:27:22.258Z [DEBUG] Resource state not found for node "aws_instance.web", instance aws_instance.web
2023-01-18T05:27:22.259Z [DEBUG] ProviderTransformer: "random_pet.sg (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/random"]
2023-01-18T05:27:22.259Z [DEBUG] ProviderTransformer: "aws_instance.web" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:27:22.259Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:27:22.259Z [DEBUG] ProviderTransformer: "aws_instance.web (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:27:22.259Z [DEBUG] ProviderTransformer: "random_pet.sg" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/hashicorp/random"]
2023-01-18T05:27:22.259Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:27:22.259Z [DEBUG] ReferenceTransformer: "random_pet.sg (expand)" references: []
2023-01-18T05:27:22.259Z [DEBUG] ReferenceTransformer: "output.web-address (expand)" references: [aws_instance.web (expand) aws_instance.web aws_instance.web]
2023-01-18T05:27:22.259Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg (expand)" references: []
2023-01-18T05:27:22.259Z [DEBUG] ReferenceTransformer: "aws_instance.web (expand)" references: []
2023-01-18T05:27:22.259Z [DEBUG] ReferenceTransformer: "random_pet.sg" references: []
2023-01-18T05:27:22.259Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg" references: [random_pet.sg (expand) random_pet.sg random_pet.sg]
2023-01-18T05:27:22.260Z [DEBUG] ReferenceTransformer: "aws_instance.web" references: [aws_security_group.web-sg (expand) aws_security_group.web-sg aws_security_group.web-sg]
2023-01-18T05:27:22.260Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/random\"]" references: []
2023-01-18T05:27:22.260Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/aws\"]" references: []
2023-01-18T05:27:22.260Z [INFO]  backend/local: plan operation completed
2023-01-18T05:27:22.260Z [INFO]  backend/local: writing plan output to: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-cNDutDGiphZYW1ds/config/terraform.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                          = "ami-0688ba7eeeeefe3cd"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tenancy                      = (known after apply)
      + user_data                    = "d36263b945850b1251dc22e4ed5c62aeb9e9e0f0"
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.web-sg will be created
  + resource "aws_security_group" "web-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # random_pet.sg will be created
  + resource "random_pet" "sg" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + web-address = (known after apply)

```

</details>

*Pushed by: @dassiorleando, Action: `pull_request`*